/*==============================================
	■■■ 연산자(Operator) ■■■
	- 비트 단위 연산자(비트 쉬프트 연산자, 비트열이동연산자)
===============================================*/

public class Test024
{
	public static void main(String[] args)
	{
						//							  |
		int x = 128;	// 00000000 00000000 00000000 10000000	--==>> 실제로는 비트끼리 붙어있음(공백X)
													//	  					  |
		System.out.printf("x << 3 : %d\n", x<<3);	// 00000000 00000000 00000100 00000000 == x<<n : 2^n만큼 곱한다.
		System.out.printf("x * 8 : %d\n", x*8);
													//	  					         |
		System.out.printf("x >> 3 : %d\n", x>>3);	// 00000000 00000000 00000000 00010000 == x>>n : 2^n만큼 나눈다.
		System.out.printf("x / 8 : %d\n", x/8);
													// |
		System.out.printf("x << 24 : %d\n", x<<24);	// 10000000 00000000 00000000 00000000 ==> msb 부호 1, 나머지 0이므로 음수인 최솟값이 된다.
		//--==>> x << 24 : -2147483648
		// 10000000 00000000 00000000 00000000

													//							   |-----|  : 모두 0으로 사용자에게 '보여짐'
		System.out.printf("x << 25 : %d\n", x<<25);	// 00000000 00000000 00000000 00000000
		System.out.printf("x << 25 : %d\n", x<<26);	// 00000000 00000000 00000000 00000000
		System.out.printf("x << 25 : %d\n", x<<29);	// 00000000 00000000 00000000 00000000
		System.out.printf("x << 25 : %d\n", x<<31);	// 00000000 00000000 00000000 00000000
													//							  |         : 원래의 초기화된 x값, 128
		System.out.printf("x << 25 : %d\n", x<<32);	// 00000000 00000000 00000000 10000000


	}
}

//실행 결과

/*
x << 3 : 1024
x * 8 : 1024
x >> 3 : 16
x / 8 : 16
x << 24 : -2147483648
x << 25 : 0
x << 25 : 0
x << 25 : 0
x << 25 : 0
x << 25 : 128
계속하려면 아무 키나 누르십시오 . . .
*/
