/*==================================
  ■■■ 정렬(Sort) 알고리즘 ■■■
  - 버블 정렬(Bubble Sort)
===================================*/

/*
○ 정렬
	: 데이터를 특정한 규칙(기준)에 맞게 순서대로 나열(오름차순, 내림차순)

○ 정렬의 목적
	: 데이터 처리 과정의 편의성이나 가독성을 높이기 위함
		→ 보기 좋게... 검색하기 위함

○ 정렬의 종류
	: 선택 정렬, 버블 정렬, 삽입 정렬, 힙 정렬, 퀵 정렬, 쉘 정렬...

*/

// 실행 예)
// Source Data : 52 42 12 62 60
// Sorted Data : 12 42 52 60 62
// 계속하려면 아무 키나 누르세요...


public class Test111
{
	public static void main(String[] args)
	{
		int[] a = {52, 42, 12, 62, 60};

		/*
		가장 큰 수가 오른편에 먼저(<-> 선택형은 작은 수가 왼편먼저)

		52 42 12 62 60
		== --

		42 52 12 62 60
		   == --

		42 12 52 62 60
		      == --

		42 12 52 62 60
		         == --

		42 12 52 60 62
		------------------- 1회전
		
		42 12 52 60 62
	    == --
		12 42 52 60 62
		   == --
		12 42 52 60 62
		      == --
		12 42 52 60 62
		 
		------------------- 2회전

		12 42 52 60 62
		== --
		12 42 52 60 62
		   == --
		------------------- 3회전

		12 42 52 60 62
		== --
		------------------- 4회전
		12 42 52 60 62
		
		*/

		int i,j;

		System.out.print("Source Data : ");
		for (int n : a)
			System.out.print(n + " ");
		System.out.println();


		// Bubble Sort 구현

		for (i=1; i<a.length; i++)				// 뒤에서 비교대상을 하나씩 줄어주는 역할
		{
			for (j=0; j<a.length-i; j++)		// 
			{
				// 테스트(확인)
				//System.out.print("[" + j + ", " + (j+1) + "]");
				//--==>> [0, 1][1, 2][2, 3][3, 4][0, 1][1, 2][2, 3][0, 1][1, 2][0, 1]

					a[j] = a[j]^a[j+1];
					a[j+1] = a[j+1]^a[j];
					a[j] = a[j]^a[j+1];


			}
		}



		System.out.print("Sorted Data : ");
		for (int n : a)
			System.out.print(n + " ");
		System.out.println();

		// 실행 결과
		/*
		*/


		/*
		int i,j;

		for (int n : a)
		{
			System.out.print(n + " ");
		}
		System.out.println();
		//--==>> 52 42 12 62 60

		// Bubble Sort
		
		// i는 비교기준, a[i]는 a.[0]부터 1씩증가하는데 범위가 1씩줄어들다가 0으로 돌아옴(0123 012 01 0)
		// j는 비교대상, a[j]는 a.[i+1[부터 1씩증가하는데 범위가 1씩줄어들다가 1로 돌아옴(1234 123 12 1)
		

		for (i=4; i>0; i--)
		{
			for (j=0; j<i; j++)
			{
				if (a[j]>a[j+1])
				{
					a[j] = a[j]^a[j+1];
					a[j+1] = a[j+1]^a[j];
					a[j] = a[j]^a[j+1];
				}	
			}
		}

		

		System.out.print("Sorted Data : ");
		for (int n : a)
			System.out.print(n + " ");
		System.out.println();
		//--==>> Sorted Data : 12 42 52 60 62

*/

	}
}